src/cf/BusinessProcesses/ЗаявкаНаИзменение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<BusinessProcess>
		<Properties>
			<Name>ЗаявкаНаИзменение</Name>
			<Task>Task.ЗадачаИсполнителя</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявкиНаИзменение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммныйПродукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммныеПродукты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичноеОбращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Программист</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Техлид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акцептант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановыеТрудозатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

src/cf/InformationRegisters/ТрудозатратыПоЗаявкамНаИзменение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ТрудозатратыПоЗаявкамНаИзменение</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Трудозатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаИзменение</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ЗаявкаНаИзменение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/BusinessProcesses/ЗаявкаНаИзменение/Forms/ФормаБизнесПроцесса/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.ЗадачаИсполнителя) Тогда
		ЗадачаИсполнителя = Параметры.ЗадачаИсполнителя;
		Элементы.СледующийСтатус.СписокВыбора.ЗагрузитьЗначения(БизнесПроцессы.ЗаявкаНаИзменение.ДоступныеСтатусы(Объект.Статус));
		Если Элементы.СледующийСтатус.СписокВыбора.Количество() = 1 Тогда
			СледующийСтатус = Элементы.СледующийСтатус.СписокВыбора[0].Значение;
		КонецЕсли;
		Элементы.ФормаЗадачаВыполнена.Видимость = Истина;
		Элементы.ФормаСтартовать.Видимость = Ложь;
		Элементы.ЗадачаИсполнителяДата.Видимость = Истина;
		АвтоЗаголовок = Ложь;
		Заголовок = СтрШаблон("%1", ЗадачаИсполнителя.Наименование);
	Иначе
		Элементы.ФормаСтартовать.Видимость = НЕ Объект.Стартован;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьЗадачу(Команда)
	Если НЕ ЗначениеЗаполнено(СледующийСтатус) Тогда
		ПоказатьПредупреждение(, "Выберите следующий статус");
		Возврат;
	КонецЕсли;
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	Успешно = ВыполнитьЗадачуНаСервере();
	Если Успешно Тогда
		Закрыть();
	Иначе
		Прочитать();
	КонецЕсли;
	ОповеститьОбИзменении(ЗадачаИсполнителя);
	ОповеститьОбИзменении(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ВвестиТрудозатраты(Команда)
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ЗаявкаНаИзменение", Объект.Ссылка);
	ПараметрыЗаписи.Вставить("Задача", ЗадачаИсполнителя);
	ОткрытьФорму("РегистрСведений.ТрудозатратыПоЗаявкамНаИзменение.ФормаЗаписи", ПараметрыЗаписи, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыполнитьЗадачуНаСервере()
	Успешно = Истина;
	НачатьТранзакцию();
	Попытка
		Объект.Статус = СледующийСтатус;
		Записать();
		ЗадачаИсполнителя.ПолучитьОбъект().ВыполнитьЗадачу();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Успешно = Ложь;
	КонецПопытки;
	Возврат Успешно;
КонецФункции

&НаКлиенте
Процедура Стартовать(Команда)
	СтартоватьНаСервере();
КонецПроцедуры

Процедура СтартоватьНаСервере()
	БПОбъект = РеквизитФормыВЗначение("Объект");
	БПОбъект.Записать();
	БПОбъект.Старт();
	ЗначениеВРеквизитФормы(БПОбъект, "Объект");
	Модифицированность = Ложь;
КонецПроцедуры

#КонецОбласти
